In [3]:
from utils.db_connector import Db_Connector
db_conn = Db_Connector()

sql_create_db = '''
CREATE TABLE transactions (
                    id INTEGER PRIMARY KEY,
                    mov_date DATE,
                    mov_type TEXT,
                    amount NUMERIC,
                    comments TEXT
                )

'''

sql_create_db = '''
CREATE TABLE date_groups (
                    id INTEGER PRIMARY KEY,
                    start_date DATE,
                    end_date DATE,
                    label TEXT
                )

'''

db_conn.run_query_on_db(sql=sql_create_db)

# modify values on database transactions

In [4]:
# Check values to modify 
data = db_conn.sql_to_df(sql='select * from transactions order by mov_date')
data

,id,mov_date,mov_type,amount,comments
0,1,2023-10-13,INCOME,41915.16,salario octubre
1,11,2023-10-15,CREDIT_PAYMENT,99.00,Disney y Start plus pagado en mercado pago
2,3,2023-10-16,CREDIT_PAYMENT,13039.71,Invex Tarjetas
3,5,2023-10-17,CREDIT_PAYMENT,11876.32,Hipoteca pago
4,10,2023-10-18,CREDIT_PAYMENT,494.00,Seguro Yaris IBM cobro santander
5,2,2023-10-26,CREDIT_PAYMENT,9209.99,pago de bbva credit
6,4,2023-11-05,CREDIT_PAYMENT,8873.53,Rappi payment
7,6,2023-11-14,INCOME,41000.00,Salario
8,7,2023-11-14,INCOME,2500.00,Vales despensa
9,12,2023-11-15,CREDIT_PAYMENT,99.00,Disney plus y start Mercado Pago
10,8,2023-11-17,CREDIT_PAYMENT,11800.00,Hipoteca
11,9,2023-11-18,CREDIT_PAYMENT,494.43,Cobro de santander Seguro IBM Yaris

In [18]:
# Check values to modify 
data = db_conn.sql_to_df(sql='select * from date_groups')
data

   id  start_date    end_date                 label
0   1  2023-10-13  2023-11-13          OCT-NOV-2023
1   2  2023-11-14  2023-12-13          NOV-DIC-2023
2   3  2023-12-14  2024-01-11  DICIEMBRE-ENERO-2024

# Modify move_type or comments

In [9]:
print('--- MODIFY MOV_TYPE OR COMENTS START ----')

print(db_conn.sql_to_df(sql='select * from transactions'))

# for all except mov_date and amount
field = 'comments'
new_value = 'salario octubre'
field_id =  1 #number

sql_modify = f'''UPDATE transactions 
            SET {field} = '{new_value}'
            WHERE id = {field_id}'''

print('--- QUERY TO APPLY  ----')
print(sql_modify)

db_conn.run_query_on_db(sql=sql_modify)

print('--- RESULTS ----')
print(db_conn.sql_to_df(sql='select * from transactions'))

--- MODIFY MOV_TYPE OR COMENTS START ----
   id    mov_date        mov_type    amount                  comments
0   1  2023-10-13          INCOME  41915.16  salario octubre modified
1   2  2023-10-27  CREDIT_PAYMENT   9209.99       pago de bbva credit
2   3  2023-10-16  CREDIT_PAYMENT  13039.71            Invex Tarjetas
3   4  2023-11-05  CREDIT_PAYMENT   8873.53             Rappi payment
4   5  2023-10-17  CREDIT_PAYMENT  11876.32             Hipoteca pago
5   6  2023-11-14          INCOME  41000.00                   Salario
--- QUERY TO APPLY  ----
UPDATE transactions
            SET comments = 'salario octubre'
            WHERE id = 1
--- RESULTS ----
   id    mov_date        mov_type    amount             comments
0   1  2023-10-13          INCOME  41915.16      salario octubre
1   2  2023-10-27  CREDIT_PAYMENT   9209.99  pago de bbva credit
2   3  2023-10-16  CREDIT_PAYMENT  13039.71       Invex Tarjetas
3   4  2023-11-05  CREDIT_PAYMENT   8873.53        Rappi payment
4   5  2023-10-17  CREDIT_PAYMENT  11876.32        Hipoteca pago
5   6  2023-11-14          INCOME  41000.00              Salario

# Modify Mov_date

In [10]:
print('--- MODIFY mov_date START ----')

print(db_conn.sql_to_df(sql='select * from transactions'))

# for all except mov_date and amount
field = 'mov_date'
new_value = '2023-10-26' # year-month-day
field_id =  2 #number

sql_modify = f'''UPDATE transactions 
            SET {field} = '{new_value}'
            WHERE id = {field_id}'''

print('--- QUERY TO APPLY  ----')
print(sql_modify)

db_conn.run_query_on_db(sql=sql_modify)

print('--- RESULTS ----')
print(db_conn.sql_to_df(sql='select * from transactions'))

--- MODIFY mov_date START ----
   id    mov_date        mov_type    amount             comments
0   1  2023-10-13          INCOME  41915.16      salario octubre
1   2  2023-10-27  CREDIT_PAYMENT   9209.99  pago de bbva credit
2   3  2023-10-16  CREDIT_PAYMENT  13039.71       Invex Tarjetas
3   4  2023-11-05  CREDIT_PAYMENT   8873.53        Rappi payment
4   5  2023-10-17  CREDIT_PAYMENT  11876.32        Hipoteca pago
5   6  2023-11-14          INCOME  41000.00              Salario
--- QUERY TO APPLY  ----
UPDATE transactions
            SET mov_date = '2023-10-26'
            WHERE id = 2
--- RESULTS ----
   id    mov_date        mov_type    amount             comments
0   1  2023-10-13          INCOME  41915.16      salario octubre
1   2  2023-10-26  CREDIT_PAYMENT   9209.99  pago de bbva credit
2   3  2023-10-16  CREDIT_PAYMENT  13039.71       Invex Tarjetas
3   4  2023-11-05  CREDIT_PAYMENT   8873.53        Rappi payment
4   5  2023-10-17  CREDIT_PAYMENT  11876.32        Hipoteca pago
5   6  2023-11-14          INCOME  41000.00              Salario

# Modify amount

In [5]:
print('--- MODIFY amount START ----')

print(db_conn.sql_to_df(sql='select * from transactions'))

# for all except mov_date and amount
field = 'amount'
new_value =  6582.76
field_id =   4

sql_modify = f'''UPDATE transactions 
            SET {field} = '{new_value}'
            WHERE id = {field_id}'''

print('--- QUERY TO APPLY  ----')
print(sql_modify)

db_conn.run_query_on_db(sql=sql_modify)

print('--- RESULTS ----')
print(db_conn.sql_to_df(sql='select * from transactions'))

--- MODIFY amount START ----
    id    mov_date        mov_type    amount  \
0    1  2023-10-13          INCOME  41915.16
1    2  2023-10-26  CREDIT_PAYMENT   9209.99
2    3  2023-10-16  CREDIT_PAYMENT  13039.71
3    4  2023-11-05  CREDIT_PAYMENT   8873.53
4    5  2023-10-17  CREDIT_PAYMENT  11876.32
5    6  2023-11-14          INCOME  41000.00
6    7  2023-11-14          INCOME   2500.00
7    8  2023-11-17  CREDIT_PAYMENT  11800.00
8    9  2023-11-18  CREDIT_PAYMENT    494.43
9   10  2023-10-18  CREDIT_PAYMENT    494.00
10  11  2023-10-15  CREDIT_PAYMENT     99.00
11  12  2023-11-15  CREDIT_PAYMENT     99.00

                                       comments
0                               salario octubre
1                           pago de bbva credit
2                                Invex Tarjetas
3                                 Rappi payment
4                                 Hipoteca pago
5                                       Salario
6                               Vales despensa
7                                      Hipoteca
8           Cobro de santander Seguro IBM Yaris
9              Seguro Yaris IBM cobro santander
10  Disney y  Start plus pagado en mercado pago
11             Disney plus y start Mercado Pago
--- QUERY TO APPLY  ----
UPDATE transactions
            SET amount = '6582.76'
            WHERE id = 4
--- RESULTS ----
    id    mov_date        mov_type    amount  \
0    1  2023-10-13          INCOME  41915.16
1    2  2023-10-26  CREDIT_PAYMENT   9209.99
2    3  2023-10-16  CREDIT_PAYMENT  13039.71
3    4  2023-11-05  CREDIT_PAYMENT   6582.76
4    5  2023-10-17  CREDIT_PAYMENT  11876.32
5    6  2023-11-14          INCOME  41000.00
6    7  2023-11-14          INCOME   2500.00
7    8  2023-11-17  CREDIT_PAYMENT  11800.00
8    9  2023-11-18  CREDIT_PAYMENT    494.43
9   10  2023-10-18  CREDIT_PAYMENT    494.00
10  11  2023-10-15  CREDIT_PAYMENT     99.00
11  12  2023-11-15  CREDIT_PAYMENT     99.00

                                       comments
0                               salario octubre
1                           pago de bbva credit
2                                Invex Tarjetas
3                                 Rappi payment
4                                 Hipoteca pago
5                                       Salario
6                               Vales despensa
7                                      Hipoteca
8           Cobro de santander Seguro IBM Yaris
9              Seguro Yaris IBM cobro santander
10  Disney y  Start plus pagado en mercado pago
11             Disney plus y start Mercado Pago